## 1.) Import relevant libraries -> Numpy, Pandas, Matplotlib
## 2.) Create and read into the file we are interested to analyze

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
gr = pd.read_csv('/home/enumtheworld/gr_sendsms.csv', low_memory = False) ##creating dataframe, assigning the name gr to it.

## Display 10 first lines of dataframe called 'gr'

In [2]:
gr.head(10)

,Date,Time,Price,MSISDN,MSGID,AGG,Result,Code,Description,Description2,Operator,Service/Keyword
0,1/Oct/2018,00:24,208,(306)-945450360,834265719720S,AMAZE/19366,Success,5,Delivered To Phone,NaN,20205,trivia
1,1/Oct/2018,00:24,208,(306)-945450360,834265819726O,AMAZE/19366,Success,5,Delivered To Phone,NaN,20205,trivia
2,1/Oct/2018,00:24,208,(306)-945450360,834265819730F,AMAZE/19366,Success,5,Delivered To Phone,NaN,20205,trivia
3,1/Oct/2018,00:24,208,(306)-942019956,834268619802B,AMAZE/19366,Failed,12,Out of Credit Vodafone,NaN,20205,trivia
4,1/Oct/2018,00:24,208,(306)-942019956,834268719807T,AMAZE/19366,Failed,12,Out of Credit Vodafone,NaN,20205,trivia
5,1/Oct/2018,00:24,208,(306)-942019956,834268719810P,AMAZE/19366,Failed,12,Out of Credit Vodafone,NaN,20205,trivia
6,1/Oct/2018,00:39,208,(306)-955506964,834355322761V,AMAZE/19366,Failed,13,Subscriber Barred,NaN,20205,trivia
7,1/Oct/2018,00:39,208,(306)-955506964,834355322766V,AMAZE/19366,Failed,13,Subscriber Barred,NaN,20205,trivia
8,1/Oct/2018,00:39,208,(306)-955506964,834355422770K,AMAZE/19366,Failed,13,Subscriber Barred,NaN,20205,trivia
9,1/Oct/2018,01:57,208,(306)-944811010,83482727684E,AMAZE/19366,Failed,13,Subscriber Barred,NaN,20205,trivia

## Shape shows the database, here we have close to 19M rows on 12 columns ##

In [2]:
gr.shape

(18941098, 12)

## How many unique aggregators are there?

In [4]:
gr.AGG.value_counts() , sum(gr.AGG.value_counts())

(NETSMART3/54422    6082919
 AMAZE/19366        4250978
 NETSMART4/54422    3862503
 NETSMART/54422     2978787
 AMAZE2/19366        837682
 NETSMART2/54422     768555
 VEOO/54850          159630
 AMAZE3/19366            43
 Name: AGG, dtype: int64, 18941097)

In [5]:
gr.AGG.unique().tolist()

['AMAZE/19366',
 'NETSMART/54422',
 'NETSMART4/54422',
 'NETSMART3/54422',
 'NETSMART2/54422',
 'VEOO/54850',
 nan,
 'AMAZE2/19366',
 'AMAZE3/19366']

## How many operators are there?

In [6]:
gr.Operator.value_counts()

CosmOte        6253690
265            2393602
VodafoneGR     2080322
20210          1974315
268            1677533
WIND           1548833
Cosmote         698068
635             678700
20201           438341
20209           392734
20205           333070
Wind            219005
Vodafone        214877
20214             8093
GR_WIND            444
00                 245
CyTa               196
GR_VODAFONE         45
GR_COSMOTE          24
Name: Operator, dtype: int64

In [8]:
sum(gr.Operator.value_counts())

18912137

## How many keywords are there?

In [8]:
gr["Service/Keyword"].value_counts()

games     14677676
trivia     3994826
pics         42446
Name: Service/Keyword, dtype: int64

In [9]:
sum(gr["Service/Keyword"].value_counts())

18714948

In [10]:
gr["Service/Keyword"].unique()

array(['trivia', 'games', nan, 'pics'], dtype=object)

## We received value of 'nan' *blanks*, how do we analyze it?
1.) Let's have a look at all indexes, "True" means we have NaN values:

In [11]:
gr.isnull().any()

Date               False
Time               False
Price              False
MSISDN             False
MSGID               True
AGG                 True
Result              True
Code                True
Description         True
Description2        True
Operator            True
Service/Keyword     True
dtype: bool

2.) Let's check how many NaN for each column, it will help us spot more issues:

In [12]:
null_columns = gr.columns[gr.isnull().any()]
gr[null_columns].isnull().sum()

MSGID                    51
AGG                       1
Result             13178982
Code               13178982
Description        14021846
Description2       18829361
Operator              28961
Service/Keyword      226150
dtype: int64

3.) Based on results I will create a new DataFrame (gr1) I will also omit a few columns which I do not need for my research

In [13]:
gr1 = pd.read_csv('/home/enumtheworld/gr_sendsms.csv', usecols=['Date', 'Time', 'MSISDN', 'AGG', 'Result', 'Description', 'Operator', 'Service/Keyword'], low_memory=False)

In [14]:
gr1.head()

,Date,Time,MSISDN,AGG,Result,Description,Operator,Service/Keyword
0,1/Oct/2018,00:24,(306)-945450360,AMAZE/19366,Success,Delivered To Phone,20205,trivia
1,1/Oct/2018,00:24,(306)-945450360,AMAZE/19366,Success,Delivered To Phone,20205,trivia
2,1/Oct/2018,00:24,(306)-945450360,AMAZE/19366,Success,Delivered To Phone,20205,trivia
3,1/Oct/2018,00:24,(306)-942019956,AMAZE/19366,Failed,Out of Credit Vodafone,20205,trivia
4,1/Oct/2018,00:24,(306)-942019956,AMAZE/19366,Failed,Out of Credit Vodafone,20205,trivia

In [16]:
gr1.isnull().any()

Date               False
Time               False
MSISDN             False
AGG                 True
Result              True
Description         True
Operator            True
Service/Keyword     True
dtype: bool

In [19]:
null_columns1 = gr1.columns[gr1.isnull().any()]
gr1[null_columns1].isnull().sum()

AGG                       1
Result             13178982
Description        14021846
Operator              28961
Service/Keyword      226150
dtype: int64

5.) I would like to get rid of the 1 missing AGG row

In [21]:
gr1 = gr1.dropna(subset=['AGG'])

In [23]:
null_columns1 = gr1.columns[gr1.isnull().any()]
gr1[null_columns1].isnull().sum()

Result             13178982
Description        14021845
Operator              28960
Service/Keyword      226149
dtype: int64

## 1.) This is a pivot table, counting all failed Results by MNOs

In [3]:
gr.pivot_table(['MSISDN'], index='AGG', columns='Result', aggfunc='count', fill_value=0, margins = True)

                 MSISDN
Result            Error   Failed Success      All
AGG
AMAZE/19366          90  3961321   65908  4027319
AMAZE2/19366          2   764480   15773   780255
AMAZE3/19366          0       24      12       36
NETSMART/54422   193778        0       0   193778
NETSMART2/54422   16110        0       0    16110
NETSMART3/54422  466377        0       0   466377
NETSMART4/54422  119311        0       0   119311
VEOO/54850        47192   105561    6176   158929
All              842860  4831386   87869  5762115

## List of MSISDNs by billing attempts over the last 3 months

In [25]:
gr.MSISDN.value_counts().head(10)

(306)-980353339    345
(306)-997934164    342
(306)-972186921    327
(306)-955369099    324
(306)-979975809    324
(306)-994416727    322
(306)-997908864    289
(306)-985666437    285
(306)-986112771    279
(306)-995715315    271
Name: MSISDN, dtype: int64

## 2.) Applying a filter to previous list (bigger than 200) and displaying result

In [27]:
gr.MSISDN.value_counts()[gr.MSISDN.value_counts()>200]

(306)-980353339    345
(306)-997934164    342
(306)-972186921    327
(306)-955369099    324
(306)-979975809    324
(306)-994416727    322
(306)-997908864    289
(306)-985666437    285
(306)-986112771    279
(306)-995715315    271
(306)-977395938    268
(306)-943735535    264
(306)-987927755    263
(306)-934167460    258
(306)-995310292    254
(306)-936212398    252
(306)-949372332    252
(306)-907525948    252
(306)-932430746    252
(306)-982907764    252
(306)-994991950    251
(306)-987267747    250
(306)-983741970    250
(306)-945264167    250
(306)-980833747    250
(306)-906098786    249
(306)-934417877    249
(306)-944415390    249
(306)-972904791    247
(306)-971928866    247
                  ...
(306)-972840259    204
(306)-984619220    204
(306)-984463504    204
(306)-986897715    204
(306)-980336250    204
(306)-955539743    204
(306)-939171762    204
(306)-982314851    203
(306)-995335456    203
(306)-999926545    203
(306)-980505426    203
(306)-980599749    203
(306)-970539407    202
(306)-993233090    201
(306)-993902456    201
(306)-995141972    201
(306)-980186732    201
(306)-983803617    201
(306)-937002213    201
(306)-982694000    201
(306)-932538048    201
(306)-970732145    201
(306)-996625902    201
(306)-945846293    201
(306)-946161740    201
(306)-980357637    201
(306)-971655286    201
(306)-955703795    201
(306)-985962547    201
(306)-948968863    201
Name: MSISDN, Length: 209, dtype: int64

## 3.) List of Service/Keyword by Aggregator

In [28]:
gr.pivot_table(['MSISDN'], index=['AGG'], columns='Service/Keyword', aggfunc='count', fill_value=0, margins = True)

                   MSISDN
Service/Keyword     games   pics   trivia       All
AGG
AMAZE/19366        256095      0  3994826   4250921
AMAZE2/19366       800774  36902        0    837676
AMAZE3/19366           43      0        0        43
NETSMART/54422    2970299      0        0   2970299
NETSMART2/54422    767634      0        0    767634
NETSMART3/54422   5971096      0        0   5971096
NETSMART4/54422   3761873      0        0   3761873
VEOO/54850         149862   5544        0    155406
All              14677676  42446  3994826  18714948

## Setup categories inside one of my indexes.
You can define categories of each index to filter what you want to be seeing.

here is the counts of keywords in Greece the last 3 months:

In [29]:
gr["Service/Keyword"].value_counts()

games     14677676
trivia     3994826
pics         42446
Name: Service/Keyword, dtype: int64

## Suppose I want to see only trivia category: ##
For the sake of order I will be creating a new dataframe for this (gr1).

In [35]:
gr1 = gr[:] ##create clone out of GR
gr1["Service/Keyword"] = gr1["Service/Keyword"].astype("category") ##setup column category
gr1["Service/Keyword"].cat.set_categories(["trivia"], inplace=True) ##setup trivia as category
gr1["Service/Keyword"].value_counts()

trivia    3994826
Name: Service/Keyword, dtype: int64

## Previous pivot table would change accordingly

In [34]:
gr1.pivot_table(['MSISDN'], index=['AGG'], columns='Service/Keyword', aggfunc='count', fill_value=0, margins = True)

                  MSISDN
Service/Keyword   trivia      All
AGG
AMAZE/19366      3994826  3994826
All              3994826  3994826